import { defineConfig } from 'vitepress'

export default defineConfig({
  title: "前端视界",
  description: "构建健壮系统，驱动产品增长",
  head: [['link', { rel: 'icon', href: '/logo.png' }]],
  lastUpdated: true,
  ignoreDeadLinks: true,
  themeConfig: {
    logo: '/logo.png',
    search: {
      provider: 'local'
    },
    outline: {
      level: [2, 3],
      label: '大纲目录'
    },
    nav: [
      { text: '技术与研发', link: '/技术与研发/' },
      { text: '产品设计', link: '/产品与设计/' },
      { text: '业务运营', link: '/业务与运营/' }
    ],
    sidebar: {
      '/技术与研发/': [
        {
          "text": "大前端全栈概念全景自检字典 Checklist",
          "link": "/技术与研发/大前端全栈概念全景自检字典_Checklist.md"
        },
        {
          "text": "AI与前沿探索",
          "collapsed": false,
          "items": [
            {
              "text": "AI 辅助编程系统化",
              "collapsed": false,
              "items": [
                {
                  "text": "Cursor - Copilot 在万行陈旧代码重构、单测自动生成中的高阶套路",
                  "link": "/技术与研发/AI与前沿探索/AI_辅助编程系统化/Cursor_-_Copilot_在万行陈旧代码重构、单测自动生成中的高阶套路.md"
                },
                {
                  "text": "基于个人知识库体系的私有化 AI Agent 流水线探索与搭建",
                  "link": "/技术与研发/AI与前沿探索/AI_辅助编程系统化/基于个人知识库体系的私有化_AI_Agent_流水线探索与搭建.md"
                }
              ]
            },
            {
              "text": "Prompt 提示词开发效能工程",
              "collapsed": false,
              "items": [
                {
                  "text": "提升开发效能的结构化 Prompt 库沉淀与代码自动化 Code Review 专属模板",
                  "link": "/技术与研发/AI与前沿探索/Prompt_提示词开发效能工程/提升开发效能的结构化_Prompt_库沉淀与代码自动化_Code_Review_专属模板.md"
                }
              ]
            },
            {
              "text": "前端计算极限探索",
              "collapsed": false,
              "items": [
                {
                  "text": "Rust 工具链生态 (SWC - Rspack) 对前端工程化构建降维打击的持续追踪",
                  "link": "/技术与研发/AI与前沿探索/前端计算极限探索/Rust_工具链生态_(SWC_-_Rspack)_对前端工程化构建降维打击的持续追踪.md"
                },
                {
                  "text": "WebAssembly 在前端海量图片渲染 - 视频解析计算场景中的性能突破",
                  "link": "/技术与研发/AI与前沿探索/前端计算极限探索/WebAssembly_在前端海量图片渲染_-_视频解析计算场景中的性能突破.md"
                }
              ]
            },
            {
              "text": "大模型前端工程化",
              "collapsed": false,
              "items": [
                {
                  "text": "RAG 检索增强生成原理在企业内部前端文档库搜索中的落地与流式渲染调优",
                  "link": "/技术与研发/AI与前沿探索/大模型前端工程化/RAG_检索增强生成原理在企业内部前端文档库搜索中的落地与流式渲染调优.md"
                }
              ]
            }
          ]
        },
        {
          "text": "前端开发",
          "collapsed": false,
          "items": [
            {
              "text": "前端工程化与组件化",
              "collapsed": false,
              "items": [
                {
                  "text": "万行级代码防腐化：基于 ESLint-Husky-Prettier 的深度定制化拦截与 CI-CD...",
                  "link": "/技术与研发/前端开发/前端工程化与组件化/万行级代码防腐化：基于_ESLint-Husky-Prettier_的深度定制化拦截与_CI-CD....md"
                },
                {
                  "text": "万行级前端工程规范与代码治理实战",
                  "link": "/技术与研发/前端开发/前端工程化与组件化/万行级前端工程规范与代码治理实战.md"
                },
                {
                  "text": "前端脚手架 (CLI) 的自研与企业级项目模板自动化分发方案",
                  "link": "/技术与研发/前端开发/前端工程化与组件化/前端脚手架_(CLI)_的自研与企业级项目模板自动化分发方案.md"
                },
                {
                  "text": "定制化 UI 组件库的从 0 到 1：基于 Monorepo 的包管理与自动化按需加载设计",
                  "link": "/技术与研发/前端开发/前端工程化与组件化/定制化_UI_组件库的从_0_到_1：基于_Monorepo_的包管理与自动化按需加载设计.md"
                },
                {
                  "text": "现代前端构建体系原理与调优：Webpack到Vite的平滑过渡",
                  "link": "/技术与研发/前端开发/前端工程化与组件化/现代前端构建体系原理与调优：Webpack到Vite的平滑过渡.md"
                }
              ]
            },
            {
              "text": "性能优化与安全",
              "collapsed": false,
              "items": [
                {
                  "text": "WebGL与Three.js渲染管线及前端内存管控",
                  "link": "/技术与研发/前端开发/性能优化与安全/WebGL与Three.js渲染管线及前端内存管控.md"
                },
                {
                  "text": "前端内存泄漏与全链路性能监控体系建设指南",
                  "link": "/技术与研发/前端开发/性能优化与安全/前端内存泄漏与全链路性能监控体系建设指南.md"
                },
                {
                  "text": "前端防高维攻击：基于 BFF 层的反 XSS-CSRF 终极方案与 CSP 内容安全策略",
                  "link": "/技术与研发/前端开发/性能优化与安全/前端防高维攻击：基于_BFF_层的反_XSS-CSRF_终极方案与_CSP_内容安全策略.md"
                },
                {
                  "text": "首屏秒开与长列表渲染的极致性能优化策略",
                  "link": "/技术与研发/前端开发/性能优化与安全/首屏秒开与长列表渲染的极致性能优化策略.md"
                }
              ]
            },
            {
              "text": "框架内核与生态",
              "collapsed": false,
              "items": [
                {
                  "text": "React Fiber与Concurrent并发架构源码级调度解析",
                  "link": "/技术与研发/前端开发/框架内核与生态/React_Fiber与Concurrent并发架构源码级调度解析.md"
                },
                {
                  "text": "React Hooks架构与闭包陷阱",
                  "link": "/技术与研发/前端开发/框架内核与生态/React_Hooks架构与闭包陷阱.md"
                },
                {
                  "text": "SSR (Nuxt-Next) 服务端渲染的 Node.js 内存泄露排查与首屏 TTFB 极限优化",
                  "link": "/技术与研发/前端开发/框架内核与生态/SSR_(Nuxt-Next)_服务端渲染的_Node.js_内存泄露排查与首屏_TTFB_极限优化.md"
                },
                {
                  "text": "Vue2与3及React响应式与渲染机制源码级深度横评",
                  "link": "/技术与研发/前端开发/框架内核与生态/Vue2与3及React响应式与渲染机制源码级深度横评.md"
                },
                {
                  "text": "Vue3 响应式内核与编译时演进",
                  "link": "/技术与研发/前端开发/框架内核与生态/Vue3_响应式内核与编译时演进.md"
                },
                {
                  "text": "万行级项目中状态管理 (Pinia-Redux) 的竞态控制与读写性能瓶颈突破",
                  "link": "/技术与研发/前端开发/框架内核与生态/万行级项目中状态管理_(Pinia-Redux)_的竞态控制与读写性能瓶颈突破.md"
                }
              ]
            },
            {
              "text": "语言内核与基建重塑",
              "collapsed": false,
              "items": [
                {
                  "text": "CSS 渲染机制与架构演进",
                  "link": "/技术与研发/前端开发/语言内核与基建重塑/CSS_渲染机制与架构演进.md"
                },
                {
                  "text": "HTML 渲染核心与语义化重塑",
                  "link": "/技术与研发/前端开发/语言内核与基建重塑/HTML_渲染核心与语义化重塑.md"
                },
                {
                  "text": "JavaScript TypeScript 核心闭环 从原型链 闭包陷阱到高阶类型体操的体系化梳理",
                  "link": "/技术与研发/前端开发/语言内核与基建重塑/JavaScript_TypeScript_核心闭环_从原型链_闭包陷阱到高阶类型体操的体系化梳理.md"
                },
                {
                  "text": "jQuery 历史启示与设计模式",
                  "link": "/技术与研发/前端开发/语言内核与基建重塑/jQuery_历史启示与设计模式.md"
                },
                {
                  "text": "前端工程化演进全景 从 Gulp Webpack 构建痛点到 Vite Rspack 时代的架构变迁",
                  "link": "/技术与研发/前端开发/语言内核与基建重塑/前端工程化演进全景_从_Gulp_Webpack_构建痛点到_Vite_Rspack_时代的架构变迁.md"
                },
                {
                  "text": "响应式框架底层对比 Vue2 3 与 React 设计思想与演进史",
                  "link": "/技术与研发/前端开发/语言内核与基建重塑/响应式框架底层对比_Vue2_3_与_React_设计思想与演进史.md"
                },
                {
                  "text": "跨端与多端架构体系志 响应式H5 微信小程序底层 RN与uni-app跨端方案的生命周期与性能天花板对比",
                  "link": "/技术与研发/前端开发/语言内核与基建重塑/跨端与多端架构体系志_响应式H5_微信小程序底层_RN与uni-app跨端方案的生命周期与性能天花板对比.md"
                }
              ]
            },
            {
              "text": "语言底座与高阶特性",
              "collapsed": false,
              "items": [
                {
                  "text": "ES6 核心机制与进阶应用",
                  "link": "/技术与研发/前端开发/语言底座与高阶特性/ES6_核心机制与进阶应用.md"
                },
                {
                  "text": "JavaScript 执行机制与内存突围",
                  "link": "/技术与研发/前端开发/语言底座与高阶特性/JavaScript_执行机制与内存突围.md"
                },
                {
                  "text": "Promise A+规范与微任务调度的底层实现解构",
                  "link": "/技术与研发/前端开发/语言底座与高阶特性/Promise_A+规范与微任务调度的底层实现解构.md"
                },
                {
                  "text": "TypeScript 高级类型体操与工程实践",
                  "link": "/技术与研发/前端开发/语言底座与高阶特性/TypeScript_高级类型体操与工程实践.md"
                },
                {
                  "text": "V8 引擎垃圾回收机制与前端内存泄漏全链路监控体系方案",
                  "link": "/技术与研发/前端开发/语言底座与高阶特性/V8_引擎垃圾回收机制与前端内存泄漏全链路监控体系方案.md"
                },
                {
                  "text": "高并发-高频交互下的事件循环 (Event Loop) 调度与 Web Worker 离线计算优化",
                  "link": "/技术与研发/前端开发/语言底座与高阶特性/高并发-高频交互下的事件循环_(Event_Loop)_调度与_Web_Worker_离线计算优化.md"
                }
              ]
            },
            {
              "text": "跨端与多端底层架构",
              "collapsed": false,
              "items": [
                {
                  "text": "PWA - Electron 桌面级前端应用的探索与进程间 (IPC) 通信耗时优化",
                  "link": "/技术与研发/前端开发/跨端与多端底层架构/PWA_-_Electron_桌面级前端应用的探索与进程间_(IPC)_通信耗时优化.md"
                },
                {
                  "text": "UniApp与ReactNative架构对比与技术选型防坑指南",
                  "link": "/技术与研发/前端开发/跨端与多端底层架构/UniApp与ReactNative架构对比与技术选型防坑指南.md"
                },
                {
                  "text": "微信小程序底层渲染机制：双线程通信带来的 setData 阻塞问题与终极解决思路",
                  "link": "/技术与研发/前端开发/跨端与多端底层架构/微信小程序底层渲染机制：双线程通信带来的_setData_阻塞问题与终极解决思路.md"
                },
                {
                  "text": "跨端架构演进：从ReactNative到Flutter的平滑过渡指南",
                  "link": "/技术与研发/前端开发/跨端与多端底层架构/跨端架构演进：从ReactNative到Flutter的平滑过渡指南.md"
                }
              ]
            }
          ]
        },
        {
          "text": "后端开发与中间件",
          "collapsed": false,
          "items": [
            {
              "text": "全栈链路与服务端基建",
              "collapsed": false,
              "items": [
                {
                  "text": "BFF 层架构标准 Node.js 底层模型 中间件洋葱模型与企业级异常拦截流转",
                  "link": "/技术与研发/后端开发与中间件/全栈链路与服务端基建/BFF_层架构标准_Node.js_底层模型_中间件洋葱模型与企业级异常拦截流转.md"
                },
                {
                  "text": "Web 网络与系统运维 HTTP演进 TCP IP核心防坑 Linux Nginx高频运维指令盘点",
                  "link": "/技术与研发/后端开发与中间件/全栈链路与服务端基建/Web_网络与系统运维_HTTP演进_TCP_IP核心防坑_Linux_Nginx高频运维指令盘点.md"
                },
                {
                  "text": "数据层与中间件 MySQL索引与表设计规范 Redis核心应用场景聚合 Kafka RabbitMQ前端防丢失全景图",
                  "link": "/技术与研发/后端开发与中间件/全栈链路与服务端基建/数据层与中间件_MySQL索引与表设计规范_Redis核心应用场景聚合_Kafka_RabbitMQ前端防丢失全景图.md"
                }
              ]
            },
            {
              "text": "关系型数据库进阶",
              "collapsed": false,
              "items": [
                {
                  "text": "千万级数据的表结构拆分（分库分表）与外键约束取舍",
                  "link": "/技术与研发/后端开发与中间件/关系型数据库进阶/千万级数据的表结构拆分（分库分表）与外键约束取舍.md"
                },
                {
                  "text": "复杂业务的事务隔离级别：幻读-脏读场景分析与乐观锁-悲观锁在订单状态防刷中的应用",
                  "link": "/技术与研发/后端开发与中间件/关系型数据库进阶/复杂业务的事务隔离级别：幻读-脏读场景分析与乐观锁-悲观锁在订单状态防刷中的应用.md"
                }
              ]
            },
            {
              "text": "服务端语言与框架",
              "collapsed": false,
              "items": [
                {
                  "text": "BFF层(Node.js)架构设计与业务聚合实战",
                  "link": "/技术与研发/后端开发与中间件/服务端语言与框架/BFF层(Node.js)架构设计与业务聚合实战.md"
                },
                {
                  "text": "Nest.js - Express.js 架构设计：中间件洋葱模型与企业级异常拦截链路",
                  "link": "/技术与研发/后端开发与中间件/服务端语言与框架/Nest.js_-_Express.js_架构设计：中间件洋葱模型与企业级异常拦截链路.md"
                },
                {
                  "text": "NodeJS 事件驱动机制与架构演进",
                  "link": "/技术与研发/后端开发与中间件/服务端语言与框架/NodeJS_事件驱动机制与架构演进.md"
                },
                {
                  "text": "大前端视角的Node.js BFF架构演进与NestJS实战",
                  "link": "/技术与研发/后端开发与中间件/服务端语言与框架/大前端视角的Node.js_BFF架构演进与NestJS实战.md"
                },
                {
                  "text": "大前端视角的Node.js BFF架构演进与NestJS實战",
                  "link": "/技术与研发/后端开发与中间件/服务端语言与框架/大前端视角的Node.js_BFF架构演进与NestJS實战.md"
                }
              ]
            },
            {
              "text": "消息队列架构实战",
              "collapsed": false,
              "items": [
                {
                  "text": "异步任务削峰填谷：在前端长链接实时推送架构中的落地",
                  "link": "/技术与研发/后端开发与中间件/消息队列架构实战/异步任务削峰填谷：在前端长链接实时推送架构中的落地.md"
                },
                {
                  "text": "消息防丢失设计、幂等性消费在前端状态回流中的一致性保障",
                  "link": "/技术与研发/后端开发与中间件/消息队列架构实战/消息防丢失设计、幂等性消费在前端状态回流中的一致性保障.md"
                }
              ]
            },
            {
              "text": "缓存架构与海量数据",
              "collapsed": false,
              "items": [
                {
                  "text": "MongoDB 在动态表单配置-埋点日志海量存储中的文档模型设计",
                  "link": "/技术与研发/后端开发与中间件/缓存架构与海量数据/MongoDB_在动态表单配置-埋点日志海量存储中的文档模型设计.md"
                },
                {
                  "text": "大前端视角的Redis缓存与MySQL高频实战指南",
                  "link": "/技术与研发/后端开发与中间件/缓存架构与海量数据/大前端视角的Redis缓存与MySQL高频实战指南.md"
                },
                {
                  "text": "缓存击穿、缓存穿透与缓存雪崩的系统级防御与兜底预案",
                  "link": "/技术与研发/后端开发与中间件/缓存架构与海量数据/缓存击穿、缓存穿透与缓存雪崩的系统级防御与兜底预案.md"
                }
              ]
            }
          ]
        },
        {
          "text": "系统架构与设计模式",
          "collapsed": false,
          "items": [
            {
              "text": "分布式与微前端深度治理",
              "collapsed": false,
              "items": [
                {
                  "text": "后端微服务的客户端网关层映射与多集群环境下的环境切换设计",
                  "link": "/技术与研发/系统架构与设计模式/分布式与微前端深度治理/后端微服务的客户端网关层映射与多集群环境下的环境切换设计.md"
                },
                {
                  "text": "微前端(qiankun&wujie)架构拆分实战与技术债治理",
                  "link": "/技术与研发/系统架构与设计模式/分布式与微前端深度治理/微前端(qiankun&wujie)架构拆分实战与技术债治理.md"
                },
                {
                  "text": "电商B端基建：基于微前端的运营工作台与低代码营销活动搭建引擎",
                  "link": "/技术与研发/系统架构与设计模式/分布式与微前端深度治理/电商B端基建：基于微前端的运营工作台与低代码营销活动搭建引擎.md"
                }
              ]
            },
            {
              "text": "复杂业务系统全链路设计",
              "collapsed": false,
              "items": [
                {
                  "text": "低代码 (Low-Code) 平台：JSON Schema 渲染引擎与组件物料协议架构设计",
                  "link": "/技术与研发/系统架构与设计模式/复杂业务系统全链路设计/低代码_(Low-Code)_平台：JSON_Schema_渲染引擎与组件物料协议架构设计.md"
                },
                {
                  "text": "动态路由与中后台RBAC权限全链路设计",
                  "link": "/技术与研发/系统架构与设计模式/复杂业务系统全链路设计/动态路由与中后台RBAC权限全链路设计.md"
                },
                {
                  "text": "复杂商城架构：购物车的高并发状态同步、订单流转闭环与微信-支付宝跨端支付架构设计",
                  "link": "/技术与研发/系统架构与设计模式/复杂业务系统全链路设计/复杂商城架构：购物车的高并发状态同步、订单流转闭环与微信-支付宝跨端支付架构设计.md"
                },
                {
                  "text": "大促秒杀场景下的前端高可用架构：削峰填谷与离线降级策略",
                  "link": "/技术与研发/系统架构与设计模式/复杂业务系统全链路设计/大促秒杀场景下的前端高可用架构：削峰填谷与离线降级策略.md"
                }
              ]
            },
            {
              "text": "设计模式与技术债重构",
              "collapsed": false,
              "items": [
                {
                  "text": "SOLID 原则在前端定制化业务线组件设计中的全盘落地",
                  "link": "/技术与研发/系统架构与设计模式/设计模式与技术债重构/SOLID_原则在前端定制化业务线组件设计中的全盘落地.md"
                },
                {
                  "text": "大前端复杂业务场景下的设计模式演进与落地",
                  "link": "/技术与研发/系统架构与设计模式/设计模式与技术债重构/大前端复杂业务场景下的设计模式演进与落地.md"
                },
                {
                  "text": "领域驱动设计(DDD)在复杂前端架构中的落地映射",
                  "link": "/技术与研发/系统架构与设计模式/设计模式与技术债重构/领域驱动设计(DDD)在复杂前端架构中的落地映射.md"
                }
              ]
            }
          ]
        },
        
        {
          "text": "解决方案与代码片段",
          "collapsed": false,
          "items": [
            {
              "text": "开箱即用的轮子与中间件封装",
              "collapsed": false,
              "items": [
                {
                  "text": "Axios 高阶封装层：请求重试、重复请求合并拦截与无感知 Token 刷新模块",
                  "link": "/技术与研发/解决方案与代码片段/开箱即用的轮子与中间件封装/Axios_高阶封装层：请求重试、重复请求合并拦截与无感知_Token_刷新模块.md"
                },
                {
                  "text": "业务级复杂正则大全 (脱敏-千分位-URL解析等极致优化版)",
                  "link": "/技术与研发/解决方案与代码片段/开箱即用的轮子与中间件封装/业务级复杂正则大全_(脱敏-千分位-URL解析等极致优化版).md"
                },
                {
                  "text": "强解耦的高性能全局 EventBus 发布订阅管理器实现",
                  "link": "/技术与研发/解决方案与代码片段/开箱即用的轮子与中间件封装/强解耦的高性能全局_EventBus_发布订阅管理器实现.md"
                }
              ]
            },
            {
              "text": "报错排查与宕机复盘",
              "collapsed": false,
              "items": [
                {
                  "text": "Node.js 生产环境 OOM 宕机快照分析与连接池泄漏溯源",
                  "link": "/技术与研发/解决方案与代码片段/报错排查与宕机复盘/Node.js_生产环境_OOM_宕机快照分析与连接池泄漏溯源.md"
                },
                {
                  "text": "React-Native与Uni-app核心踩坑与高频Bugs规避指南",
                  "link": "/技术与研发/解决方案与代码片段/报错排查与宕机复盘/React-Native与Uni-app核心踩坑与高频Bugs规避指南.md"
                },
                {
                  "text": "Vue3 异步组件配合 Vue Router 导致的 Chunk 挂掉引发的白屏抢救",
                  "link": "/技术与研发/解决方案与代码片段/报错排查与宕机复盘/Vue3_异步组件配合_Vue_Router_导致的_Chunk_挂掉引发的白屏抢救.md"
                }
              ]
            },
            {
              "text": "第三方服务无感接入",
              "collapsed": false,
              "items": [
                {
                  "text": "微信全家桶（小程序登录、扫码登录、NativeApp分享、支付闭环）联调避坑备忘录",
                  "link": "/技术与研发/解决方案与代码片段/第三方服务无感接入/微信全家桶（小程序登录、扫码登录、NativeApp分享、支付闭环）联调避坑备忘录.md"
                },
                {
                  "text": "阿里云 - 腾讯云 OSS 前端直传大文件切片与断点续传极简架构",
                  "link": "/技术与研发/解决方案与代码片段/第三方服务无感接入/阿里云_-_腾讯云_OSS_前端直传大文件切片与断点续传极简架构.md"
                }
              ]
            }
          ]
        },
        {
          "text": "运维部署与云原生",
          "collapsed": false,
          "items": [
            {
              "text": "容器化高阶部署",
              "collapsed": false,
              "items": [
                {
                  "text": "K8s (Kubernetes) 基础拓扑认知：Pods、节点调度、前端容器化部署的高可用回滚策略",
                  "link": "/技术与研发/运维部署与云原生/容器化高阶部署/K8s_(Kubernetes)_基础拓扑认知：Pods、节点调度、前端容器化部署的高可用回滚策略.md"
                },
                {
                  "text": "前端 Docker 镜像极致瘦身与多阶段构建 (Multi-stage build) 实战",
                  "link": "/技术与研发/运维部署与云原生/容器化高阶部署/前端_Docker_镜像极致瘦身与多阶段构建_(Multi-stage_build)_实战.md"
                }
              ]
            },
            {
              "text": "服务器运维监控预警",
              "collapsed": false,
              "items": [
                {
                  "text": "前端视角的Nginx高阶配置与线上异常监控(Sentry)闭环",
                  "link": "/技术与研发/运维部署与云原生/服务器运维监控预警/前端视角的Nginx高阶配置与线上异常监控(Sentry)闭环.md"
                },
                {
                  "text": "服务器并发资源压测 (JMeter) 与 Node.js 进程级性能监控预警闭环",
                  "link": "/技术与研发/运维部署与云原生/服务器运维监控预警/服务器并发资源压测_(JMeter)_与_Node.js_进程级性能监控预警闭环.md"
                }
              ]
            },
            {
              "text": "网络通信与跨域隔离",
              "collapsed": false,
              "items": [
                {
                  "text": "OAuth2.0 - JWT 单点登录 (SSO) 机制的跨域鉴权全流程架构设计",
                  "link": "/技术与研发/运维部署与云原生/网络通信与跨域隔离/OAuth2.0_-_JWT_单点登录_(SSO)_机制的跨域鉴权全流程架构设计.md"
                },
                {
                  "text": "WebRTC与WebSocket在低延迟音视频通信中的架构演进",
                  "link": "/技术与研发/运维部署与云原生/网络通信与跨域隔离/WebRTC与WebSocket在低延迟音视频通信中的架构演进.md"
                }
              ]
            },
            {
              "text": "自动化流水线演练",
              "collapsed": false,
              "items": [
                {
                  "text": "GitHub Actions 定制化前端发版工作流与钉钉-飞书机器人自动化通知闭环",
                  "link": "/技术与研发/运维部署与云原生/自动化流水线演练/GitHub_Actions_定制化前端发版工作流与钉钉-飞书机器人自动化通知闭环.md"
                },
                {
                  "text": "GitOps与企业级CI-CD流水线的深度定制化实战",
                  "link": "/技术与研发/运维部署与云原生/自动化流水线演练/GitOps与企业级CI-CD流水线的深度定制化实战.md"
                },
                {
                  "text": "前端工程的GitLabCI与GitHubActions体系化构建",
                  "link": "/技术与研发/运维部署与云原生/自动化流水线演练/前端工程的GitLabCI与GitHubActions体系化构建.md"
                }
              ]
            }
          ]
        }
      ],
      '/产品与设计/': [
        {
          "text": "信息架构与产品解构",
          "collapsed": false,
          "items": [
            {
              "text": "SKU与SPU模型：从产品配置抽象看前端多维数据联动",
              "link": "/产品与设计/信息架构与产品解构/SKU与SPU模型：从产品配置抽象看前端多维数据联动.md"
            },
            {
              "text": "把产品需求当成路由图：信息架构与MVP边界拆解",
              "link": "/产品与设计/信息架构与产品解构/把产品需求当成路由图：信息架构与MVP边界拆解.md"
            },
            {
              "text": "数据驱动与同理心陷阱 AB测试背后的幸存者偏差",
              "link": "/产品与设计/信息架构与产品解构/数据驱动与同理心陷阱_AB测试背后的幸存者偏差.md"
            },
            {
              "text": "电商底层抽象：“人、货、场”模型的前端工程化映射",
              "link": "/产品与设计/信息架构与产品解构/电商底层抽象：“人、货、场”模型的前端工程化映射.md"
            },
            {
              "text": "电商核心链路：从购物车到支付状态机的路由与交互流转",
              "link": "/产品与设计/信息架构与产品解构/电商核心链路：从购物车到支付状态机的路由与交互流转.md"
            }
          ]
        },
        {
          "text": "商业洞察与独立产品",
          "collapsed": false,
          "items": [
            {
              "text": "从技术自嗨到商业PMF：独立开发者的SaaS生存模型",
              "link": "/产品与设计/商业洞察与独立产品/从技术自嗨到商业PMF：独立开发者的SaaS生存模型.md"
            },
            {
              "text": "增长飞轮与社交图谱机制 像设计缓存一致性一样设计传播链",
              "link": "/产品与设计/商业洞察与独立产品/增长飞轮与社交图谱机制_像设计缓存一致性一样设计传播链.md"
            },
            {
              "text": "定价策略与SaaS支付墙设计 从鉴权中间件到商业化拦截",
              "link": "/产品与设计/商业洞察与独立产品/定价策略与SaaS支付墙设计_从鉴权中间件到商业化拦截.md"
            }
          ]
        },
        {
          "text": "设计心理学与交互定律",
          "collapsed": false,
          "items": [
            {
              "text": "从DOM靶区到菲茨定律：前端视角的交互设计心理学",
              "link": "/产品与设计/设计心理学与交互定律/从DOM靶区到菲茨定律：前端视角的交互设计心理学.md"
            },
            {
              "text": "微交互与状态感知：用CSS缓动曲线重塑用户情绪",
              "link": "/产品与设计/设计心理学与交互定律/微交互与状态感知：用CSS缓动曲线重塑用户情绪.md"
            },
            {
              "text": "无障碍与包容性设计：跳出 div 包万物的同理心重构",
              "link": "/产品与设计/设计心理学与交互定律/无障碍与包容性设计：跳出_div_包万物的同理心重构.md"
            },
            {
              "text": "用户体验地图与边缘状态机 产品视角的异常流设计",
              "link": "/产品与设计/设计心理学与交互定律/用户体验地图与边缘状态机_产品视角的异常流设计.md"
            }
          ]
        }
      ],
      '/业务与运营/': [
        {
          "text": "AARRR增长漏斗与SEO",
          "collapsed": false,
          "items": [
            {
              "text": "SSR与SSG的商业价值 爬虫视角下的长尾词动态渲染",
              "link": "/业务与运营/AARRR增长漏斗与SEO/SSR与SSG的商业价值_爬虫视角下的长尾词动态渲染.md"
            },
            {
              "text": "把增长漏斗当成瀑布图：AARRR模型与现代架构SEO调优",
              "link": "/业务与运营/AARRR增长漏斗与SEO/把增长漏斗当成瀑布图：AARRR模型与现代架构SEO调优.md"
            },
            {
              "text": "魔法数字与激活点AhaMoment 从首屏FCP看心智留存",
              "link": "/业务与运营/AARRR增长漏斗与SEO/魔法数字与激活点AhaMoment_从首屏FCP看心智留存.md"
            }
          ]
        },
        {
          "text": "内容杠杆与个人品牌",
          "collapsed": false,
          "items": [
            {
              "text": "个人内容矩阵运营 用Monorepo思维管理多平台分发",
              "link": "/业务与运营/内容杠杆与个人品牌/个人内容矩阵运营_用Monorepo思维管理多平台分发.md"
            },
            {
              "text": "开源与自媒体的飞轮效应：技术人的最高维度杠杆",
              "link": "/业务与运营/内容杠杆与个人品牌/开源与自媒体的飞轮效应：技术人的最高维度杠杆.md"
            },
            {
              "text": "知识IP的私域流量池 从CDN公域分发到ServiceWorker持久化缓存",
              "link": "/业务与运营/内容杠杆与个人品牌/知识IP的私域流量池_从CDN公域分发到ServiceWorker持久化缓存.md"
            }
          ]
        },
        {
          "text": "数据指标体系与埋点基建",
          "collapsed": false,
          "items": [
            {
              "text": "前端视角的北极星指标：DAU、留存率与神策无埋点架构防漏报",
              "link": "/业务与运营/数据指标体系与埋点基建/前端视角的北极星指标：DAU、留存率与神策无埋点架构防漏报.md"
            },
            {
              "text": "归因分析与防抖节流 在乱序用户行为中寻找转化根因",
              "link": "/业务与运营/数据指标体系与埋点基建/归因分析与防抖节流_在乱序用户行为中寻找转化根因.md"
            },
            {
              "text": "用户标签与画像系统 将用户视为多重状态的Context对象",
              "link": "/业务与运营/数据指标体系与埋点基建/用户标签与画像系统_将用户视为多重状态的Context对象.md"
            }
          ]
        }
      ]
    },
    socialLinks: [
      { icon: 'github', link: 'https://github.com/lhncxf' }
    ]
  }
})
